_notes/_posts/programming/2023-12-27-cppcoreguidelines-slstr12.org
#+layout: post
#+title: CppCoreGuidelines SL.str.12 用 s 后缀字面量标识标准库的字符串
#+categories: technology
#+tags: CppCoreGuidelines

[[http://kimi.im/tags.html#CppCoreGuidelines-ref][C++ 核心指南目录]]

"Use the ~s~ suffix for string literals meant to be standard-library
~string~ s"

理由

直接表达意图，避免误解。


例子

#+header: :namespaces std :includes  <iostream> <vector> <algorithm>
#+begin_src C++ :exports both :flags -std=c++20  :eval no-export :results output
auto pp1 = make_pair("Tokyo", 9.00);         // {C-style string,double} intended?
pair<string, double> pp2 = {"Tokyo", 9.00};  // a bit verbose
auto pp3 = make_pair("Tokyo"s, 9.00);        // {std::string,double}    // C++14
pair pp4 = {"Tokyo"s, 9.00};                 // {std::string,double}    // C++17
#+end_src
